import React, { useCallback, useEffect, useState } from "react";
import Router, { useRouter } from "next/router";
import {
  Input,
  Button,
  Form,
  Checkbox,
  message,
  DatePicker,
  Modal,
} from "antd";
import { EyeInvisibleOutlined, EyeTwoTone } from "@ant-design/icons";
import useInput from "../../hooks/useInput";
import { useDispatch, useSelector } from "react-redux";
import { SIGNUP_REQUEST, USER_FIND_USERID_REQUEST } from "../../reducers/user";
import ClientLayout from "../../components/ClientLayout";
import Head from "next/head";
import wrapper from "../../store/configureStore";
import { LOAD_MY_INFO_REQUEST } from "../../reducers/user";
import axios from "axios";
import { END } from "redux-saga";
import {
  Image,
  RsWrapper,
  Text,
  WholeWrapper,
  Wrapper,
  CommonButton,
  TextInput,
  SpanText,
} from "../../components/commonComponents";
import useWidth from "../../hooks/useWidth";
import Theme from "../../components/Theme";
import styled from "styled-components";
import DaumPostcode from "react-daum-postcode";

const PreText = styled.pre`
  width: 100%;
`;

const TermsText = styled(Wrapper)`
  overflow: auto;
  justify-content: flex-start;
  padding: 20px;
  height: 260px;
  border: 1px solid #f1f1f1;
  box-shadow: 2px 2px 10px #eee;
  background: ${Theme.white_C};
`;

const CustomCheckbox = styled(Checkbox)`
  & .ant-checkbox-inner {
    width: 20px;
    height: 20px;
    display: flex;
    justify-content: center;
    align-items: center;
  }

  & .ant-checkbox-inner::after {
    top: 44%;

    width: 6.714286px;
    height: 11.142857px;
  }
`;

const CustomForm = styled(Form)`
  width: 100%;

  & .ant-form-item {
    width: 100%;
  }
`;

const SignUp = () => {
  ////// GLOBAL STATE //////

  ////// HOOKS //////
  const width = useWidth();
  const dispatch = useDispatch();

  const router = useRouter();

  const [cForm] = Form.useForm();

  const [selectTab, setSelectTab] = useState(1);

  const [checkBox01, setCheckBox01] = useState(false);
  const [checkBox02, setCheckBox02] = useState(false);

  const [aModal, setAModal] = useState(false);

  const [selectGender, setSelectGender] = useState(null);

  ////// REDUX //////
  const {
    st_signUpLoading,
    st_signUpDone,
    //
    st_userCheckUserIdLoading,
    st_userCheckUserIdDone,
    st_userCheckUserIdError,
  } = useSelector((state) => state.user);
  ////// USEEFFECT //////
  useEffect(() => {
    if (st_signUpDone) {
      setSelectTab(3);
    }
  }, [st_signUpDone]);

  useEffect(() => {
    if (st_userCheckUserIdDone) {
      return message.success("사용가능한 아이디입니다.");
    }
    if (st_userCheckUserIdError) {
      return message.error(st_userCheckUserIdError);
    }
  }, [st_userCheckUserIdDone, st_userCheckUserIdError]);
  ////// TOGGLE //////

  const checkBox01Toggle = useCallback(() => {
    setCheckBox01((prev) => !prev);
  }, [checkBox01]);
  const checkBox02Toggle = useCallback(() => {
    setCheckBox02((prev) => !prev);
  }, [checkBox02]);

  // 주소 모달
  const aModalToggle = useCallback(() => {
    setAModal((prev) => !prev);
  }, [aModal]);

  ////// HANDLER //////

  const selectTabHandler = useCallback(
    (data) => {
      if (data === 2) {
        if (!checkBox01) {
          return message.info("이용약관에 동의해주세요.");
        }
        if (!checkBox02) {
          return message.info("개인정보처리방침에 동의해주세요.");
        }
      }

      setSelectTab(data);
    },
    [selectTab, checkBox01, checkBox02]
  );

  const selectGenderHandler = useCallback(
    (data) => {
      setSelectGender(data);
    },
    [selectGender]
  );

  // 중복체크
  const userIdFindHandler = useCallback(() => {
    const formData = cForm.getFieldsValue();

    if (!formData.userId) {
      return message.info("아이디를 입력해주세요.");
    }

    dispatch({
      type: USER_FIND_USERID_REQUEST,
      data: {
        userId: formData.userId,
      },
    });
  }, []);

  // 생성
  const signupHandler = useCallback(
    (data) => {
      if (!st_userCheckUserIdDone) {
        return message.info("중복확인 후 이용해주세요.");
      }

      if (data.password !== data.rePassword) {
        return message.info("비밀번호가 같지 않습니다.");
      }

      dispatch({
        type: SIGNUP_REQUEST,
        data: {
          userId: data.userId,
          username: data.username,
          password: data.password,
          birth: data.birth ? data.birth.format("YYYY") : null,
          gender: selectGender,
          zoneCode: data.zoneCode ? data.zoneCode : null,
          address: data.address ? data.address : null,
          detailAddress: data.detailAddress ? data.detailAddress : null,
          email: data.email,
          mobile: data.mobile,
          terms: true,
        },
      });
    },
    [selectGender, st_userCheckUserIdDone]
  );

  const moveLinkHandler = useCallback((link) => {
    router.push(link);
  }, []);

  ////// DATAVIEW //////

  const tabArr = [
    {
      tab: 1,
      imagePath:
        "https://4leaf-s3.s3.ap-northeast-2.amazonaws.com/newEbook/original/%E1%84%92%E1%85%AC%E1%84%8B%E1%85%AF%E1%86%AB%E1%84%80%E1%85%A1%E1%84%8B%E1%85%B5%E1%86%B8+01.png",
    },
    {
      tab: 2,
      imagePath:
        "https://4leaf-s3.s3.ap-northeast-2.amazonaws.com/newEbook/original/%E1%84%92%E1%85%AC%E1%84%8B%E1%85%AF%E1%86%AB%E1%84%80%E1%85%A1%E1%84%8B%E1%85%B5%E1%86%B8+02.png",
    },
    {
      tab: 3,
      imagePath:
        "https://4leaf-s3.s3.ap-northeast-2.amazonaws.com/newEbook/original/%E1%84%92%E1%85%AC%E1%84%8B%E1%85%AF%E1%86%AB%E1%84%80%E1%85%A1%E1%84%8B%E1%85%B5%E1%86%B8+03.png",
    },
  ];

  return (
    <>
      <Head>
        <title>친절한 영어교실 | 회원가입</title>
      </Head>

      <ClientLayout>
        <WholeWrapper>
          <RsWrapper>
            <Wrapper margin={`120px 0 100px`}>
              <Text
                fontSize={width < 700 ? `30px` : `36px`}
                fontWeight={`700`}
                margin={`0 0 40px`}
              >
                회원가입
              </Text>

              <Image
                width={width < 700 ? `100%` : `430px`}
                src={tabArr.find((data) => data.tab === selectTab).imagePath}
                alt="tabImage"
              />

              {selectTab === 1 && (
                <Wrapper>
                  <Wrapper al={`flex-start`} margin={`60px 0 34px`}>
                    <Text fontSize={`32px`} fontWeight={`700`}>
                      이용약관
                    </Text>
                  </Wrapper>

                  <TermsText className={`scroll`} dr={`row`}>
                    <PreText>
                      {`
     제1조 (목적)
     이 약관은 친절한대학 주식회사 (이하 ‘회사’)가 회원에게 온라인 서비스를 제공하기 위하여 운영하는 www.friendlyuni.com(이하 ‘친절한영어교실’)의 이용과 관련하여 회사와 회원의 권리 및 의무 기타 필요한 사항을 규정함을 목적으로 합니다.
     
     제 2 조 (정의)
     이 약관에서 사용하는 용어의 정의는 다음 각호와 같습니다.1. 서비스 : 사유 여하를 불문하고, 회사가 운영하는 친절한영어교실을 통하여 회원에게 제공하는 일체의 용역(회사와 제휴한 온라인서비스 제공자가 제공하는 용역을 회원이 이용하는 경우에는 제휴 온라인서비스 제공자가 제공하는 용역을 포함합니다)2. 유료서비스 : 회사가 유료로 제공하는 각종 온라인디지털콘텐츠(각종 정보콘텐츠, 아이템 기타 유료콘텐츠를 포함) 기타 일체의 서비스3. 회원 : 회사의 서비스에 접속하여 이 약관에 따라 회사와 이용계약을 체결한 뒤 회사가 제공하는 서비스를 이용하는 고객4. 아이디(ID) : 회원의 식별 및 서비스 이용을 위하여 회원이 선정하고 회사가 승인하는 문자 또는 숫자의 조합5. 비밀번호 : 서비스를 이용함에 있어, 회원의 아이디(ID)와 일치되는 회원임을 확인하고, 회원의 비밀 보호를 위해 회원 자신이 설정한 문자 또는 숫자의 조합6. 포인트 : 마일리지 등과 같이 서비스의 효율적 이용을 위해 회사가 임의로 책정 또는 지급, 조정할 수 있는 재산적 가치 없는 서비스상의 가상 데이터7. 게시물 : 회원이 서비스를 이용함에 있어, 서비스상에 게시한 부호ㆍ문자ㆍ음성ㆍ음향ㆍ화상ㆍ동영상 기타 정보 형태의 글, 사진, 동영상 및 각종 파일과 링크8. 해지 : 서비스 개통 후 회사 또는 회원이 이용계약의 효력을 상실시키는 행위
     
     제3조 (약관의 게시 및 개정)
     1. 회사는 이 약관의 내용을 회원이 쉽게 확인할 수 있도록 회사의 인터넷 홈페이지(friendlyuni.com)서비스 초기 화면에 이를 게시합니다.2. 회사는 회원에게 제공하는 서비스의 품질 향상 기타 필요한 경우, ‘정보통신망이용촉진및정보보호등에관한법률(이하 ‘정보보호법’)’, ‘약관의규제에관한법률(이하 ‘약관규제법’)’ 기타 관련법령을 위배하지 아니하는 범위 내에서 이 약관을 개정할 수 있습니다.3. 회사가 이 약관을 개정하고자 할 경우, 회사는 개정 약관의 효력발생일을 명시하여 현행 약관과 함께 개정 약관의 효력발생일 30일 전부터 1항의 방법으로 개정약관을 공지합니다. 단, 회원의 권리ㆍ의무에 중대한 영향을 미치는 개정이 아닌 때에는 효력발생일 7일 전부터 이를 공지할 수 있습니다.4. 개정 약관의 효력발생일 이후 회원이 서비스를 이용하는 경우, 회사는 회원이 개정 약관에 동의한 것으로 봅니다. 단, 회원이 개정 약관에 동의하지 아니할 때에는 회원은 회사에 대하여 회원의 탈퇴 기타 이용계약을 해지할 수 있습니다.5. 유료서비스를 이용하는 회원이 이 약관의 개정에 동의하지 아니하여 이용계약을 해지한 때에는 이 약관이 정한 환불정책에 따릅니다.6. 회사는 서비스의 품질 향상, 회원 의사의 충족 기타 필요한 경우, 이 약관과 달리 개별약관을 둘 수 있고, 이 경우 1항 내지 5항을 준용합니다.
     
     제4조 (약관의 적용)
     전기통신사업법, 정보보호법, 약관규제법 기타 관련법령의 규정 중 강행규정과 이 약관의 내용이 서로 다른 경우에는 강행규정을 적용하고, 전기통신사업법, 정보보호법, 약관규제법 기타 관련법령의 규정 중 임의규정 또는 전기통신사업법, 정보보호법, 약관규제법 기타 관련법령에 규정되지 아니한 사항에 대하여는 이 약관을 적용합니다.
     
     제 5 조 (이용계약의 체결)
     1. 이용계약은 회원이 되고자 하는 자(이하 ‘가입신청자’)가 이 약관의 내용에 대하여 동의를 한 후 회원가입 신청을 하고, 회사가 위 신청에 대하여 승낙함으로써 체결됩니다.2. 1항에 의한 가입신청자의 신청에 대하여, 회사는 원칙적으로 서비스의 이용을 승낙합니다. 단, 회사는 다음 각 호의 1에 해당하는 신청에 대하여는 그 사유가 해소될 때까지 승낙을 하지 아니하거나 별도의 절차 없이 이용계약을 해지할 수 있습니다.
     1) 가입신청자가 회원 자격을 상실한 사실이 있는 경우. 단, 회원 자격을 상실한 날로부터 1년이 경과한 자로서 회사의 재가입 승낙을 얻은 경우에 는 그러하지 아니합니다.2) 가입신청자의 실명이 아니거나 타인의 명의를 이용한 경우3) 가입신청자가 허위의 정보를 기재한 경우4) 회사가 요구한 정보를 가입신청자가 제공하지 아니한 경우5) 미성년자인 가입신청자가 법정대리인의 동의를 얻지 아니한 경우6) 기타 회원의 책임있는 사유로 인하여 회사가 승낙할 수 없는 경우7) 기타 회사가 필요하다고 인정한 경우
     3. 1항에 의한 가입신청자의 신청에 대하여, 회사는 전문기관을 통한 실명확인 및 본인인증을 요청할 수 있습니다.4. 1항에 의한 가입신청자의 신청에 대하여, 회사는 서비스 설비의 부족 기타 회사의 사정을 이유로 그 승낙을 유보할 수 있습니다.5. 2항 또는 4항에 따라 회사가 회원가입 신청의 승낙을 하지 아니하거나 이를 유보한 경우, 회사는 가입신청자에게 이 사실을 알릴 수 있습니다.6. 이용계약은 회원가입 절차상 회사가 가입완료를 표시한 시점에 성립합니다.7. 회사는 서비스의 품질 향상 기타 필요한 경우, 회원을 등급별로 구분하여 이용시간, 이용횟수, 서비스 메뉴 기타 필요한 사항을 세분하여 그 이용에 차등을 둘 수 있습니다.8. 회사는 회원에 대하여 영화및비디오물의진흥에관한법률, 청소년보호법 기타 관련법령에 따른 등급 및 연령 준수를 위하여 이용제한이나 등급별 제한 기타 필요한 조치를 취할 수 있습니다.9. 회원이 이 약관에 동의함은 친절한영어교실에서 제공하거나 제공할 모든 서비스에 동의하는 것으로 봅니다.
     
     제 6 조 (회원 정보의 변경 등)
     1. 회원은 개인정보 관리화면을 통하여 언제든지 본인의 개인정보를 열람할 수 있고, 회사가 인정하는 경미한 내용을 변경 또는 수정할 수 있습니다. 단, 서비스 관리를 위하여 필요한 실명, 생년월일, 성별, 아이디 기타 회사가 정한 사항은 변경 또는 수정할 수 없습니다.2. 회원은 회원가입 신청 시 기재한 사항이 변경되었을 경우, 즉시 개인정보 관리화면을 통하여 이를 수정하거나 이메일 기타 회사가 정한 방법으로 회사에 대하여 그 변경사항을 알려야 합니다.3. 2항의 변경사항을 회사에 알리지 아니함으로써, 회원이 입은 불이익에 대하여 회사는 회원 또는 제3자에 대하여 손해배상 기타 일체의 책임을 부담하지 아니하고, 회사 또는 회사와 제휴한 온라인서비스 제공자가 입은 불이익에 대하여 회원은 손해배상 기타 일체의 책임을 부담합니다.
     
     제 7 조 (개인정보 보호 및 도용에 대한 책임 등)
     1. 회사는 『정보통신망이용촉진및정보보호에관한법률』상의 개인정보보호규정 및 정보통신부가 제정한 『개인정보 보호법』등 관련 법령이 정하는 바에 따라 회원의 개인정보를 보호하기 위하여 최선의 노력을 하고 개인정보 보호 및 사용에 대하여 관련법령 및 회사의 개인정보처리방침을 적용합니다.단, 회사의 사이트에 공식적으로 링크된 이외의 사이트에 대하여는 회사의 개인정보처리방침이 적용되지 아니합니다.2. 회원은 가입 또는 정보 변경 시 반드시 본인의 이름, 생년월일 등 기타 정확한 본인 정보를 입력하여야 하며 타인의 정보 도용 등 허위정보를 입력할 경우 서비스 이용이 제한되거나 관련 법령에 의거 처벌받을 수 있습니다.3. 판매자의 경우 자료 판매 시 정확한 개인정보를 바탕으로 본인인증 절차를 거쳐야 합니다. 만일 타인의 정보 도용 등 허위정보를 입력할 경우 거래가 정지 될 수 있으며, 관련 법령에 의거 처벌받을 수 있습니다.4. 게시물은 반드시 본인에게 저작권이 있는 자료만 등록하여야 합니다. 만일 저작권 관련 분쟁 시 모든 책임은 판매자 본인에게 있으며, 저작권법 등 관련법령 및 회사가 정한 절차에 따라 필요한 조치를 취합니다.
     
     제 8 조 (회원의 아이디 및 비밀번호의 관리 등)
     1. 회원의 아이디와 비밀번호에 대한 관리책임은 회원에게 있고, 회원은 제3자에게 이를 알리거나 알게 하여서는 아니됩니다. 제3자가 이를 이용하여 회사 또는 회사와 제휴한 온라인서비스 제공자가 제공하는 서비스를 이용하게 하여서도 아니됩니다.2. 다음 각호의 1에 해당하는 경우, 회사는 회원의 아이디 사용을 제한할 수 있습니다.
     1) 회원의 아이디가 회원의 개인정보를 유출할 우려가 있는 경우2) 회원의 아이디가 반사회적이거나 또는 미풍양속에 어긋나는 경우3) 회원의 아이디가 회사 또는 회사의 운영자로 오인할 우려가 있는 경우4) 기타 회사가 필요하다고 인정한 경우
     3. 회원이 회원의 아이디 또는 비밀번호가 유출되었거나 제3자가 이를 사용하고 있음을 안 경우, 회원은 즉시 회사에 이를 통지하고, 회사의 안내에 따라야 합니다.4. 3항의 경우, 회원이 회사에 대하여 유출 사실 또는 제3자의 사용 사실을 통지하지 아니하거나 또는 회사의 안내에 따르지 아니함으로써, 회원이 입은 불이익에 대하여 회사는 회원 또는 제3자에 대하여 손해배상 기타 일체의 책임을 부담하지 아니하고, 회사 또는 회사와 제휴한 온라인서비스 제공자가 입은 불이익에 대하여 회원은 손해배상 기타 일체의 책임을 부담합니다.
     
     제 9 조 (회원에 대한 통지)
     1. 회사가 회원에 대하여 통지할 필요가 있는 경우, 전기통신사업법 기타 관련법령 및 이 약관에 별도의 규정이 없는 한 회원이 회사에 제시한 이메일주소로서 그 통지를 할 수 있습니다.2. 회사는 회원의 전부 또는 등급별, 구매자별로 통지를 할 필요가 있는 경우, 7일 이상 회사의 인터넷 홈페이지 게시판에 게시함으로써 1항의 통지에 갈음할 수 있습니다.
     
     제 10 조 (회사의 방침)
     1. 회사는 전기통신사업법 기타 관련법령을 위반하지 아니하며, 회원에게 계속적이고 안정적인 서비스를 제공하기 위하여 최선의 노력을 다합니다.2. 회사는 회원이 안전하게 서비스를 이용할 수 있도록 개인정보(신용정보 포함) 보호를 위한 보안시스템을 갖추고 있습니다.3. 필요한 경우, 회사는 회원의 전부 또는 일부의 개인정보에 관한 통계자료를 작성하여 회사의 마케팅자료 또는 광고자료로 활용할 수 있습니다. 단, 이 경우에도 회사는 개인정보의 보호 기타 관련법령에서 정한 규정을 준수합니다.4. 서비스 이용 관련하여 회원이 제기한 불만 기타 의견이 정당하다고 회사가 인정한 경우, 회사는 관련 규정 및 절차를 통하여 이를 처리합니다. 회원이 제기한 불만 기타 의견에 대한 회사의 처리 결과에 대하여는 회원에게 게시판, 이메일 기타 적절한 방법으로 이를 통지합니다.
     
     제 11 조 (회원의 의무)
     1. 회원은 다음 각호의 1에 해당하는 행위를 하여서는 아니됩니다.
     1) 회원가입의 신청 또는 회원정보의 변경시 허위내용을 기재하는 행위2) 제3자의 개인정보를 도용하는 행위3) 회사가 게시한 정보를 변경하는 행위4) 회사 기타 제3자의 저작권 기타 일체의 권리를 침해하는 행위5) 회사 기타 제3자에 대한 명예훼손, 업무방해 기타 불법행위6) 외설 또는 폭력적인 메시지, 화상, 음성 기타 선량한 풍속에 반하는 정보, 문장, 도형 등을 서비스에 공개 또는 게시하거나 제3자에게 유포하는 행위7) 회사의 사전 서면에 의한 동의 없이 영리를 목적으로 서비스를 이용하는 행위8) 회사의 사전 서면에 의한 동의 없이 회사로부터 얻은 정보를 제3자에게 제공하거나 기타 방법으로 회원 자신의 이용 이외의 목적으로 사용하는 행위9) 기타 관련법령에 위배되는 행위
     2. 회원은 정보보호법 기타 관련법령, 이 약관, 이용안내 기타 회사가 서비스와 관련하여 공지한 사항을 준수하여야 합니다.3. 회원은 회사가 별도로 공지한 이용제한 사항을 준수하여야 합니다.4. 회원은 회사의 사전 서면에 의한 동의 없이 회사로부터 서비스를 받을 수 있는 권리, 권한을 증여하거나 양도 또는 담보제공 기타 일체의 처분행위를 하여서는 아니됩니다.5. 회원이 1항 내지 4항에 규정한 사항을 위반한 경우, 회사는 회원 또는 제3자에 대하여 민ㆍ형사상 일체의 책임을 부담하지 아니하고, 회원은 회사 또는 회사와 제휴한 온라인서비스 제공자에 대하여 민ㆍ형사상 일체의 책임을 부담합니다.
     
     제 12 조 (서비스의 제공 등)
     1. 회사는 회원에게 다음 각호의 서비스를 제공합니다.
     1) 자료구매 서비스2 검색서비스3) 기타 회사 또는 회사와 제휴한 온라인서비스 제공자가 회원에게 제공하는 일체의 서비스
     2. 서비스는 연중무휴, 1일 24시간 제공을 원칙으로 합니다.3. 컴퓨터 등 정보통신 설비의 보수점검, 교체 및 고장, 통신 두절, 서비스 설비의 장애, 서비스 이용의 폭주 또는 운영상 상당한 이유가 있는 경우, 회사는 서비스의 제공을 일시적으로 중단하거나 제한할 수 있고, 이 경우 회사는 제9조에 정한 방법으로 회원에게 통지합니다. 단, 회사가 사전에 통지할 수 없는 부득이한 사유가 있는 때에는 사후에 이를 통지할 수 있습니다.4. 회사는 서비스의 품질향상 기타 필요한 경우, 정기점검을 실시할 수 있고, 정기점검 시간, 방법 기타 필요한 사항은 서비스 제공화면에 공지한 바에 따릅니다.5. 회사는 서비스를 일정범위로 분할하여 각 범위 별로 이용가능시간을 별도로 지정할 수 있습니다. 단, 이러한 경우 회사는 회원에게 그 내용을 제9조에 정한 방법으로 공지합니다.
     
     제 13 조 (서비스의 변경 등)
     1. 서비스의 품질향상, 운영상ㆍ기술상의 필요 기타 회사가 인정하는 상당한 사유가 있는 경우, 회사는 회원에게 제공하는 서비스(서비스의 내용, 이용방법, 이용시간 기타 사항)의 전부 또는 일부를 중단, 변경하거나 추가(이하 ‘변경’)할 수 있습니다.2. 서비스의 품질향상, 운영상ㆍ기술상의 필요, 회사의 정책 기타 회사가 인정하는 상당한 사유가 있는 경우, 회사는 무료로 제공되는 서비스의 전부 또는 일부를 변경할 수 있으며, 이에 대하여 관련법령에 특별한 규정이 없는 한 회사는 회원에게 별도의 보상을 하지 아니합니다.3. 1항 또는 2항에 의한 서비스를 변경할 경우, 회사는 서비스의 변경 7일 전부터 변경사유 및 변경 내용의 요지 기타 필요한 사항을 제9조 2항에 정한 방법으로 게시합니다.
     
     제 14 조 (정보의 제공 및 광고의 게재)
     1. 회원이 서비스를 이용함에 있어 필요하다고 회사가 인정하는 경우, 회사는 회원에게 다양한 정보를 제9조에 정한 방법 기타 적절한 방법으로 제공할 수 있습니다.2. 회사는 회원의 사전 동의를 얻은 때에 한하여 1항의 정보를 전화 또는 팩스에 의하여 제공할 수 있습니다.3. 회사는 서비스의 운영과 관련하여 회사의 서비스화면이나 홈페이지, 회원의 이메일 등을 통하여 광고를 게재할 수 있습니다.4. 회원이 1항 또는 3항에 의한 정보 또는 광고를 수신한 경우, 회원은 관련법령에 따른 거래관련 정보 및 회원의 질의에 대한 답변, 정보 또는 광고가 회원의 이익을 위한 경우 등을 제외하고는 언제든지 회사에 대하여 이메일 기타 적절한 방법으로 그 수신을 거절할 수 있습니다.
     
     환불기준 원칙은 아래와 같습니다.
     
     가. 관계 법령상 환불 정책
     
     ① 회사의 본 약관상 환불규정 등은 “약관의 규제에 관한 법률”, “콘텐츠산업 진흥법”, “전자상거래 등에서의 소비자보호에 관한 법률”, “방문판매 등에 관한 법률” 등을 바탕으로 작성되었습니다.
     
     ② 회원은 다음의 경우 위 1항의 환불을 할 수 없습니다.
     
     o	1)회원에게 책임 있는 사유 또는 천재지변 사유로 “제품 및 서비스 등”이 멸실 또는 훼손된 경우
     o	2)회원의 사용 또는 일부 소비로 “제품 및 서비스 등”의 가치가 현저히 감소한 경우
     o	3)시간의 경과에 의하여 재판매가 곤란할 정도로 “제품 및 서비스 등”의 가치가 현저히 감소한 경우
     o	4)복제가 가능한 “제품 및 서비스, 전자기기, 교재 등”의 포장을 훼손한 경우
     
     ③ 현재 사용 중인 유료 서비스의 변경은 원칙적으로 불가하며, 환불과 동일한 조건으로 환불처리 후 재신청 하거나 고객센터로 문의해야 합니다.
     
     ④ 취소/환불 등의 경우 기기 및 패키지 구성품 및 추가 구성품 등의 반환에 필요한 비용은 회원이 부담합니다.
     
     나. 회사의 환불 규정
     
     ① 최초 결제승인일로부터 7일 까지(구매 방법에 따라 기간은 일부 달라질 수 있음) 환불을 요청하는 경우
     
     o	결제금액 전액을 환불해 드립니다. 다만, 다음 각 사항에 어느 하나에 해당하는 경우 회사는 결제금액에서 회원이 결제한 상품에 포함된 기기 및 패키지 구성품, 추가 구성품의 가격을 공제한 후에 환불합니다.( 패키지 구성품, 추가 구성품의 가격은 서비스 이용 계약 체결 시 안내된 최종 판매 금액을 의미합니다. 이하 같습니다.)
     
     	1)회원에게 책임 있는 사유로 교재 등이 멸실 또는 훼손된 경우
     	2)회원이 교재 등을 사용하거나 일부 소비하여 그 가치가 현저히 감소한 경우
     	3)시간의 경과에 의하여 재판매가 곤란할 정도로 교재 등의 가치가 현저히 감소한 경우
     	4)복제가 가능한 교재 등의 포장을 훼손한 경우
     	5)회원의 주문에 의하여 개별적으로 생산되어 반품 또는 환불시 회사에게 회복할 수 없는 중대한 피해가 예상되는 경우
     ② 최초 결제승인일로부터 7일 이후부터(구매 방법에 따라 기간은 일부 달라질 수 있음) 환불을 요청하는 경우
     
     o	다음의 사항에 따라 최초 결제 금액에서 공제 대상 금액을 제외하고 남은 금액으로 환불합니다.
     
     	1)최초 결제 금액이란, 일시불 및 할부 결제의 경우 결제한 전체 금액을 의미하며, 분할 결제의 경우 계약시 정한 월별 결제 금액의 전체 총액을 의미합니다.
     	2)공제 대상 금액이란 다음 각 목에 따라 공제되는 ‘구매한 상품에 따른 해지일까지의 이용료’, ‘기기 및 패키지 구성품’, ‘위약금’, ‘추가 구성품’의 총합을 의미합니다.
     
     	가) 구매한 상품에 따른 해지일까지의 이용료
     
     	(1) 최초 결제일로부터 7일까지 기간동안은 이용료를 산정하지 않습니다. 단, 환불금액 산정은 위 “나”의 “①”에 따릅니다.
     
     	(2) 최초 결제일로부터 7일 이후의 기간부터 이용료를 일할 계산합니다.
     
     	(3) 학습 시작일은 최초 결제일을 의미합니다.
     
     	나) 환급금
     	환급 프로그램에 참가한 회원에 한하여, 회원에게 지급된 환급금의 총합을 의미합니다.
     	다) 기기 및 패키지 구성품
     	전자기기는 구매일로부터 14일 이내, 비닐을 개봉하지 않은 경우에 한하여 환불이 가능합니다.
     	라) 추가 구성품
     	다음의 사항에 해당하여 상품의 가치가 훼손되었다고 판단되는 경우 최초 결제 금액에서 해당 추가 구성품의 가격을 공제 후 환불이 진행됩니다.
     	(1) 회원에게 책임 있는 사유로 교재 등이 멸실 또는 훼손된 경우
     	(2) 교재 수령 후 7일이 지나 위변조의 위험이 우려되는 경우
     	(3) 회원이 교재 등을 사용하거나 일부 소비하여 그 가치가 현저히 감소한 경우
     	(4) 시간의 경과에 의하여 재판매가 곤란할 정도로 교재 등의 가치가 현저히 감소한 경우
     	(5) 복제가 가능한 교재 등의 포장을 훼손한 경우
     	(6) 회원의 주문에 의하여 개별적으로 생산되어 반품 또는 환불시 회사에게 회복할 수 없는 중대한 피해가 예상되는 경우
     	3)‘책 구성등에 포장 및 재판매가 불가한 경우 1권에 14,000원 총 7권의 가격인 98,000을 지불합니다. 
     다. 최초 결제 금액보다 공제 대상 금액이 큰 경우
     o	해당 차액만큼을 회사에 지불하여야 정상적으로 취소, 환불 가능합니다.
     라. 회원이 ‘기기 및 패키지 구성품’ 및 ‘추가 구성품’을 지급받은 경우
     o	회원의 왕복 택배비 부담으로 ‘패키지 구성품(도서)’ 을 반환해야 합니다.
     마. 상기의 규정에도 불구하고 아래의 경우에는 여러분 개인이 결제한 전액을 환불합니다.
     o	⑴서비스 장애가 개선되지 않아 학습을 시작할 수 없거나, ⑵회사가 제시한 최소한의 기술사양을 충족하였음에도 불구하고 회사의 귀책 사유로 학습 시작을 하지 못한 경우 (단, 영상 콘텐츠의 권리를 보유하고 있는 개인, 단체, 법인의 요청으로 영상의 일부 또는 전부를 제공할 수 없는 경우는 환불 대상에서 제외됩니다.)
     바. 환불 방법
     o	① 환불에 대한 신청은 친절한대학 서비스 내 문의하기 기능을 통해 접수하거나 고객센터로 접수합니다.
     o	② 환불 의사표시에 대하여 회사가 회신한 날로 부터 영업일 기준으로 3일 이내에 환불처리 되며, 환불이 불가할 시에는 이를 사전 고지합니다.
     사. 회사는 과오금이 발생한 경우 또는 전액 환불의 경우 이용대금의 결제와 동일한 방법으로 환불하여야 합니다. 다만, 동일한 방법으로 환불이 불가능하거나 서비스의 중도해지로 인한 부분 환불 등의 경우에는 회사가 정하는 별도의 방법으로 환불합니다. 회사는 환불 의무가 발생한 날로부터 영업일 기준으로 3일 이내에 환불을 진행하며, 환불이 불가능할 때에는 이를 사전에 고지합니다. 환불에 소요되는 비용은 여러분의 귀책사유로 인한 환불의 경우에는 여러분이, 회사의 귀책사유로 인한 환불의 경우에는 회사가 각각 부담합니다.
     
     구분	변환사유 발생일	반환금액
     교습정지 ,
     자진폐원,등록말소	교습을 할 수 없거나
     교습장소를 제공할 수 없게되는 날
       이미 납부한 교습비 등을
     일한 계산한 금액
     회원이
     본인의사로
     수강을 포기한 경우
     
        교습 기간이 1개월 이내일 경우	교습시작 전	이미 납부한 교습비 등의 전액
         7일 이내
     5강이상 시청시	들은 강의수/ 전체강의수
     제외한 금액 환불
         한달이내	들은강의수/ 전체강의수
     제외한 금액을 환불
           
           
       교습 기간이 1개월 초과할 경우	기본 날짜 기준 환불	들은강의수/ 전체강의수
     제외한 금액을 환불
         100강 수강시 	지불금액의 1/2 환불
         200강 이상 수강	환불 불가
     * 기준 날짜  : 전체 지불금액 – ( 들은강의수/ 전체강의수) 
     
     
     도서 반환 기준 
     포장 회손이될 경우 1권에 정가인 14,000원 
     총 98,000원을 반환해야 합니다. 
     `}
                    </PreText>

                    <Image
                      margin={`10px 0`}
                      width={width < 700 ? `100%` : `40%`}
                      src={`https://firebasestorage.googleapis.com/v0/b/storage-4leaf.appspot.com/o/E-BOOK3%2Fassets%2Fimages%2FMM07%2F%E1%84%8B%E1%85%B5%E1%84%8B%E1%85%AD%E1%86%BC%E1%84%8B%E1%85%A3%E1%86%A8%E1%84%80%E1%85%AA%E1%86%AB.png?alt=media&token=c8a13ea4-e42a-4dc0-abd0-8fd1cca1efb1`}
                    />

                    <PreText>
                      {`
     * 기준 날짜  : 전체 지불금액 – ( 들은강의수/ 전체강의수) 
     
     7. 회사의 환불 예외사항은 다음과 같습니다.
     
     가. 회원이 관계법령 및 본 약관의 규정을 위반하여 회사로부터 강제탈퇴 처리가 되는 경우에는 본 조의 환불 규정이 적용되지 않습니다.
     나. 회사가 회원에게 무료로 지급한 할인쿠폰 등으로 인해 회원이 획득하게 된 금액에 대해서는 환불되지 않습니다.
     8. 환불 과정에서 금융수수료가 발생하는 경우, 관련 법률에 따라 결제금액의 10%를 공제하고 환불할 수 있습니다.
     9. 4항에도 불구하고 “회사”는 신뢰도 제고나 이벤트를 위해 일시적으로 환불 조건을 완화할 수 있습니다.
     
     제14-3조 환불 규정 (옵션상품 환불 규정)
     
     1. 옵션상품이란 친절한대학에서 판매 하는 상품 중 단과 영상강의 콘텐츠를 제외한 항목을 말합니다.
     2. 옵션상품은, 친절한대학과 제휴되어있는 제휴사에서 직접 배송하는 제품 입니다.
     3. 옵션상품이 이미 배송된 경우 주문취소는 불가능 합니다.
     4. 반품 및 교환은 상품수령을 확인 하지 않은 상태에서 상품 수령 후 7일 이내 제휴사와 협의하여 신청할 수 있습니다.
     5. 지정 택배가 정해져 있으므로 교환 및 반품 시 반드시 친절한대학(회사)로 먼저 문의를 주시기 바랍니다. (문의없이 개별 교환 및 반품 시 발생하는 택배비는 개인부담)
     6. 상품 수령 후 7일 이후, 별다른 추가 문의사항이 없는경우 자동 구매 확정이 됩니다.
     7. 반품/교환 사유에 따른 요청 가능 기간
     : 구매자 단순 변심은 상품 수령 후 7일 이내 (구매자 반품배송비 부담), 친절한대학(회사)로 문의(채널톡)
     : 발송한 상품에 하자가 있는경우 수령 후 7일 이내 (배송자 반품배송비 부담), 상품의 사진과 함께 친절한대학(회사)로 문의(채널톡)
     8. 반품/교환 불가능 사유
     : 구매자 단순 변심 시, 반품가능기간(상품 수령 후 7일)이 경과된 경우
     : 포장을 개봉하였거나 포장이 훼손되어 상품가치가 현저히 상실된 경우 (예. 식품, 화장품, 향수류 등)
     : 구매자의 사용(라벨이 떨어진 의류 등) 또는 시간의 경과에 의하여 상품의 가치가 현저히 감소한 경우
     : 고객주문 확인 후, 상품제작에 진행되는 주문제작 상품인 경우
     : 복제가 가능한 상품 등의 포장을 훼손한 경우 (CD, DVD, 게임, 도서 등의 경우 포장 개봉 시)
     : 위 내용과 일치 할 경우 반품, 환불, 교환이 절대 불가합니다.
     9. 환불 금액은 제품 수령 및 확인 후 환불 처리 됩니다.
     
     제15조 [과오금]
     
     1."회사"는 과오금이 발생한 경우 이용대금의 결제와 동일한 방법으로 과오금 전액을 환불하여야 합니다. 다만, 동일한 방법으로 환불이 불가능할 때는 이를 사전에 고지합니다.
     2."회사"의 책임 있는 사유로 과오금이 발생한 경우 "회사"는 계약비용, 수수료 등에 관계없이 과오금 전액을 환불합니다. 다만, "회원"의 책임 있는 사유로 과오금이 발생한 경우, "회사"가 과오금을 환불하는 데 소요되는 비용은 합리적인 범위 내에서 "회원"이 부담하여야 하며, 이는 반환되는 과오금에서 공제될 수 있습니다.
     3.“회사”는 "회원"이 주장하는 과오금에 대해 환불을 거부할 경우에 정당하게 이용대금이 부과되었음을 입증할 책임을 집니다.
     
     제16조 [회원의 게시물]
     
     1. 게시물은 “회원”이 서비스를 이용하면서 게시한 글, 사진, 각종 파일과 링크, 디지털 콘텐츠 등을 말합니다.
     2. “회원”이 서비스에 등록하는 게시물 등으로 인하여 본인 또는 타인에게 손해나 기타 문제가 발생하는 경우 “회원”은 이에 대한 전적인 책임을 지며, 회사는 이에 대하여 어떤 경우에도 책임을 지지 않습니다.
     3. 회사는 다음 각 호에 해당하는 게시물 등을 회원의 사전 동의 없이 임시 게시중단, 수정, 삭제, 이동 또는 등록 거부 등의 관련 조치를 취할 수 있습니다.
     가. 다른 회원 또는 제 3자에게 심한 모욕을 주거나 명예를 손상시키는 내용인 경우
     나. 공공질서 및 미풍양속에 위반되는 내용을 유포하거나 링크하는 경우
     다.불법복제 또는 해킹을 조장하는 내용인 경우
     라.영리를 목적으로 하는 광고일 경우
     마.범죄와 결부된다고 객관적으로 인정되는 내용일 경우
     바.다른 이용자 또는 제 3자의 저작권 등 기타 권리를 침해하는 내용인 경우
     사.사적인 정치적 판단이나 종교적 견해의 내용으로 회사가 서비스 성격에 부합하지 않는다고 판단하는 경우
     아.회사에서 규정한 게시물 원칙에 어긋나거나, 게시판 성격에 부합하지 않는 경우
     자.게시물이 내용의 질 뿐만 아니라 화질 등에 있어 회사가 정한 규정을 만족하지 못한 경우
     차.기타 관계법령에 위배된다고 판단되는 경우
     4. “회사”는 게시물 등에 대하여 제3자로부터 명예훼손, 지적재산권 등의 권리 침해를 이유로 게시중단 요청을 받은 경우 이를 임시로 게시를 중단 할 수 있으며, 이의를 제기한 자와 게시물 등록자 간에 소송, 합의 등을 통해 당해 게시물에 관한 법적 문제가 종결된 후 이를 근거로 회사에 신청이 있는 경우에만 상기 임시로 게시가 중단된 게시물은 다시 게시될 수 있습니다.
     5. “회원”이 이용계약해지를 한 경우 “회원”이 등록한 게시물은 자동 삭제되지 않으며 필요한 경우 일부만 익명화 처리됩니다. “회원”은 이용계약 해지 전에 자신의 등록한 게시물을 언제든 직접 삭제할 수 있으며, 이용계약 해지 이후에도 “회사”에 그 삭제를 요청할 수 있습니다.
     
     제17조 [게시물에 대한 저작권]
     
     1. “회사”가 작성한 게시물 또는 저작물에 대한 저작권, 기타 지적재산권은 “회사”에 귀속합니다.
     2. “회원”이 서비스 내에 게시한 게시물의 저작권은 원칙적으로 게시한 “회원”에게 귀속됩니다. 단, “회사”는 서비스의 운영, 전시, 전송, 배포, 홍보 등의 목적으로 “회원”의 별도의 허락 없이 무상으로 “회원”이 등록한 게시물을 사용할 수 있습니다.
     3. “회원”이 올린 디지털 콘텐츠가 “회원”의 동의 없이 타인에 의해 무단, 불법 복제되어 “회원”뿐 아니라 “회사”의 이익에 상충할 경우 “회사”는 “회원”을 대리해 지적재산권을 행사할 수 있습니다. 단, 이 경우 “회사”는 “회원”에게 개별적으로 동의를 받아야 합니다.
     4. “회사”는 본 조 제 2항 이외의 목적으로 “회원”의 게시물을 사용하고자 하는 경우 사전에 “회원”의 동의를 얻어 사용합니다.
     
     제18조 [광고]
     
     1. “회원”은 “서비스” 이용 시 노출되는 광고게재에 대해 동의합니다.
     2. “회사”는 서비스상에 게재되어 있거나 서비스를 통한 광고주의 판촉활동에 “회원”이 참여하거나 교신 또는 거래를 함으로써 발생하는 손실과 손해에 대해 책임을 지지 않습니다.
     
     제19조 [회원 탈퇴 및 자격상실]
     
     1. “회원”은 언제든지 서비스 내 문의 기능을 통하여 이용계약 해지(탈퇴) 신청을 할 수 있으며, 회사는 관련법 등이 정하는 바에 따라 이를 즉시 처리하여야 합니다.
     2. “회원”이 “회사”로부터 제23조에 따른 이용제한의 일환으로 영구이용정지 통보를 받거나 사망한 경우 해당 회원은 그 자격을 상실하며, 회사와의 모든 이용계약은 해지됩니다.
     3. 제1항에 의한 회원탈퇴 또는 제2항에 의한 회원자격상실 및 이용계약해지가 확정되는 시점은 아래와 같습니다.
     가. 회원자격상실의 경우 통보일에 회원 자격상실이 확정됩니다. 단, 사망으로 인한 자격상실의 경우에는 회사의 통보여부와 상관없이 회원 사망일에 자격상실이 확정되며, 당해 회원에게 제공된 기 회사의 서비스나 관련된 권리는 회원의 상속인에게 상속되지 않습니다.
     4. 상속인에게 상속되지 않습니다.“회원”이 탈퇴하거나 자격을 상실할 경우, 관련법 및 개인정보취급방침에 따라 “회사”가 회원정보를 보유하는 경우를 제외하고는 그 효력발생 시 “회원”의 모든 정보는 소멸됩니다.
     
     제20조 [이용제한]
     
     1. “회사”는 “회원”이 본 약관 제11조 제1항의 의무를 위반하거나 서비스의 정상적인 운영을 방해한 경우, 경고, 일시정지, 영구이용정지 등으로 서비스 이용을 제한할 수 있습니다.
     2. “회사”는 “회원”이 주민등록법을 위반한 명의도용 및 결제도용, 저작권법 및 컴퓨터프로그램보호법을 위반한 불법프로그램의 제공 및 운영방해, 정보통신망법을 위반한 불법통신 및 해킹, 악성프로그램의 배포, 접속 권한 초과행위 등과 같이 관련법을 위반한 경우에는 즉시 영구이용정지를 할 수 있습니다. 본 항에 따른 영구이용정지 시 서비스 이용을 통해 획득한 수익 등 기타 혜택 등도 모두 소멸되며, 회사는 이에 대해 별도로 보상하지 않습니다.
     3. “회사”는 “회원”이 계속해서 1년 이상 로그인하지 않는 경우, 회원정보의 보호 및 운영의 효율성을 위해 이용을 제한할 수 있습니다.
     4. “회사”는 본 조의 이용제한 범위 내에서 제한의 조건 및 세부내용은 이용제한정책 및 개별 서비스 상의 운영정책에서 정하는 바에 의합니다.
     5. 본 조에 따라 서비스 이용을 제한하거나 계약을 해지하는 경우에는 “회사”는 그 사유 및 제한기간 등을 회원에게 알려야 합니다.
     6. “회원”은 본 조에 따른 이용제한 등에 대해 “회사”가 정한 절차에 따라 이의신청을 할 수 있습니다. “회사”는 이의가 정당하다고 인정하는 경우 즉시 서비스의 이용을 재개합니다.
     
     제21조 [부정이용 금지 및 차단]
     
     1. “회사”는 다음 각 호에 해당하는 경우를 부정 이용행위로 봅니다.
     가.동일한 계정으로 2대 이상의 PC에서 동시접속이 발생하는 경우
     나.동일한 계정으로 다수의 PC 또는 IP에서 서비스를 이용하는 경우
     다.자신의 계정 및 강좌 등의 서비스를 타인이 이용하도록 하는 경우
     라.자신의 계정 및 강좌 등의 서비스를 타인에게 판매, 대여, 양도하는 행위 및 이를 광고하는 행위를 하는 경우
     마.서비스 이용 중, 복제프로그램을 실행하는 경우 또는 녹화를 하거나 시도하는 경우
     2. “회사”는 전항에 따른 부정 이용자가 발견 되었을 경우, 해당 이용자를 강제 탈퇴 처리하며 회사의 법률 대리인을 통한 고발조치와 민사소송을 진행할 수 있습니다.
     3. “회원”은 제2항 의 조치를 이유로, 서비스 이용기간의 연장이나 환불을 요구할 수 없습니다.
     4. “회원”은 “회사”로부터의 제2항의 조치에 대해 이의가 있는 경우, 회사의 법률 대리인을 통해 이를 소명할 수 있습니다.
     5. 부정이용 식별 및 차단은 아래 각 호의 방법에 따릅니다.
     가.“회사”는 “회원”이 서비스를 이용하는 중에 수집한 자료를 토대로 부정이용 여부를 확인합니다b.“회사”는 이용자가 서비스 이용 중에 복제프로그램을 실행시키거나 동일한 계정으로 동시 접속을 하는 경우, 서비스 이용 접속을 강제로 종료 시킵니다.
     
     제22조 [면책]
     
     1. “회사”가 천재지변 또는 이에 준하는 불가항력으로 인하여 서비스를 제공할 수 없는 경우에는 이에 대한 책임을 지지 않습니다.
     2. “회사”는 “회원”의 귀책사유(지원되지 않는 환경을 이용하는 것을 포함)로 인한 서비스 이용의 장애에 대하여는 책임을 지지 않습니다.
     3. “회사”는 “회원”이 서비스와 관련하여 게재한 정보, 자료, 사실의 신뢰도, 정확성 등의 내용에 관하여는 책임을 지지 않습니다.
     4.“회사”는 “회원” 간 또는 “회원”과 제3자 상호간에 서비스를 매개로 하여 거래 등을 한 경우에는 이로 인해 발생한 문제에 대해 책임을 지지 않습니다.
     5.“회사”는 “회사”가 무료로 제공하는 서비스의 이용과 관련하여 관련법에 특별한 규정이 없는 한 책임을 지지 않습니다.
     6.“회사”는 콘텐츠 공급자가 제공하거나 “회원”이 작성하는 등의 방법으로 서비스에 게재된 정보, 자료, 사실의 신뢰도, 정확성 등에 대해서는 보증을 하지 않으며 이로 인해 발생한 “회원”의 손해에 대하여는 책임을 부담하지 아니합니다.
     7.“회사”는 “회원”이 “회사”에 사실과 다른 내용을 제공함에 따라 발생하는 정보, 인증서 등의 오류에 대해 책임을 지지 않습니다.
     
     제23조 [재판관할 및 준거법]
     
     본 약관의 준거법은 대한민국법으로 하며, 서비스 이용과 관련하여 “회사”와 “회원” 간에 발생한 분쟁에 대해서는 서울중앙지방법원을 전속적 합의관할로 합니다.
     
     제24조 [규정의 준용]
     
     본 약관에 명시되지 않은 사항에 대해서는 한국법의 관계법령에 의하고, 법에 명시되지 않은 부분에 대하여는 관습에 의합니다.
     
               `}
                    </PreText>
                  </TermsText>

                  <Wrapper al={`flex-start`} margin={`14px 0 0`}>
                    <CustomCheckbox
                      checked={checkBox01}
                      onChange={checkBox01Toggle}
                    >
                      <Text fontSize={`22px`}>
                        (필수) 이용약관에 동의합니다.
                      </Text>
                    </CustomCheckbox>
                  </Wrapper>

                  <Wrapper al={`flex-start`} margin={`60px 0 34px`}>
                    <Text fontSize={`32px`} fontWeight={`700`}>
                      개인정보처리방침
                    </Text>
                  </Wrapper>

                  <TermsText className={`scroll`} dr={`row`}>
                    <PreText>
                      {`
     제 1 조 (목적)
     
     1. 개인정보란 생존하는 개인에 관한 정보로서 당해 정보에 포함되어 있는 성명, 주민등록번호 등의 사항에 의하여 당해 개인을 식별할 수 있는 정보(당해 정보만으로는 특정 개인을 식별할 수 없더라도 다른 정보와 용이하게 결합하여 식별할 수 있는 것을 포함합니다)를 말합니다.
     2. 친절한 영어교실은 귀하의 개인정보보호를 매우 중요시하며, 『정보통신망이용촉진및정보보호에관한법률』상의 개인정보보호규정 및 정보통신부가 제정한 『개인정보 보호법』을 준수하고 있습니다. 친절한 영어교실은 개인정보처리방침을 통하여 귀하께서 제공하시는 개인정보가 어떠한 용도와 방식으로 이용되고 있으며 개인정보보호를 위해 어떠한 조치가 취해지고 있는지 알려드립니다.
     3. 친절한 영어교실은 개인정보처리방침을 홈페이지 첫 화면에 공개함으로써 귀하께서 언제나 용이하게 보실 수 있도록 조치하고 있습니다.
     4. 친절한 영어교실은 개인정보처리방침의 지속적인 개선을 위하여 개인정보처리방침을 개정하는데 필요한 절차를 정하고 있습니다. 그리고 개인정보처리방침을 개정하는 경우 버전번호 등을 부여하여 개정된 사항을 귀하께서 쉽게 알아볼 수 있도록 하고 있습니다.
     
     제2조 (개인정보의 수집범위)
     
     친절한 영어교실은 별도의 회원가입 절차 없이 대부분의 컨텐츠에 자유롭게 접근할 수 있습니다. 그러나 친절한 영어교실은 맞춤형 서비스를 제공하기 위하여 회원서비스(유료 정보 등의 이용, 그밖에 향후 제공될 로그인 기반의 서비스) 및 제휴사를 통해 이용자의 정보를 수집하고 있습니다. 친절한 영어교실의 회원제 서비스를 이용하시고자 할 경우 다음의 정보를 입력해주셔야 하며 선택항목을 입력하시지 않았다 하여 서비스 이용에 제한은 없습니다.
     1. 회원 가입 시 수집하는 개인정보의 범위
     1) 필수항목: 희망 ID, 비밀번호, 성명, 생년월일, 성별, 전화번호, 이메일 주소, 
     ※만 14세 미만인 경우 법정대리인의 정보(이름, 연락처, 생년월일)를 추가 수집합니다.
     2) 선택항목: 자기소개, 닉네임, 이벤트 상품 배송을 위한 주소
     2. 법인회원 가입 시 수집하는 개인정보의 범위
     1) 필수항목 : 희망 ID, 비밀번호, 비밀번호 힌트/답변, 상호, 사업자 등록번호, 업태/업종, 대표자명, 소재지, 대표전화, 담당자명, 담당자 부서/직위, 담당자 전화번호, 팩스번호, 이메일 주소
     2) 선택항목: 자기소개, 닉네임, 이벤트 상품 배송을 위한 주소
     3. 외국인회원 가입 시 수집하는 개인정보의 범위
     1) 필수항목 : 희망 ID, 비밀번호, 비밀번호 힌트/답변, 성명, 생년월일, 이메일 주소, 전화번호, 성별, 외국인등록번호 또는 국적/여권번호
     2) 선택항목: 자기소개, 닉네임, 이벤트 상품 배송을 위한 주소
     4. 유료정보 이용 시 수집하는 개인정보의 제공
     1) 회원 가입 시 수집한 정보와 동일
     2) 결제방법에 따라 결제 창에 입력하는 개인정보는 결제대행사에 기록될 뿐 친절한 영어교실에 기록되지 않음
     3. 자료 판매금액 출금 시 수집하는 개인정보의 범위
     1) 은행명, 계좌번호, 주민등록번호 (최초 1회)
     4. 서비스 이용과정이나 사업처리과정에서의 자동생성 정보
     1) 서비스 이용기록, 접속로그, 쿠키, 접속 IP정보, 결제기록, 이용정지기록
     
     제3조 (개인정보 수집에 대한 동의)
     
     친절한 영어교실은 귀하께서 친절한 영어교실의 개인정보처리방침 또는 이용약관의 내용에 대해 「동의한다」버튼 또는 「동의하지 않는다」버튼을 클릭할 수 있는 절차를 마련하여, 「동의한다」버튼을 클릭하면 개인정보 수집에 대해 동의한 것으로 봅니다.
     
     제4조 (개인정보의 수집목적 및 이용목적)
     
     1. 친절한 영어교실은 다음과 같은 목적을 위하여 개인정보를 수집하고 있습니다.
     1) 성명, 아이디, 비밀번호 : 회원제 서비스 이용에 따른 본인 식별 절차에 이용
     2) 이메일주소, 전화번호: 고지사항 전달, 본인 의사 확인, 불만 처리 등 원활한 의사소통 경로의 확보, 새로운 서비스/신상품이나 이벤트 정보의 안내
     3) 주소, 전화번호: 경품 배송에 대한 정확한 배송지 확보 및 본인 식별
     4) 생년월일, 성별, 주소: 본인 식별 및 인구통계학적 분석 자료(이용자의 연령별, 성별 통계분석)
     5) 법인회원 (사업자 등록번호, 업태/업종, 담당자명, 담당자 연락처) : 세금계산서 발급
     6) 외국인회원 (외국인등록번호 또는 국적/여권번호) : 회원제 서비스 이용에 따른 본인 식별 절차에 이용
     7) 주민등록번호: 출금 회원에 한하여 소득세 신고를 위하여 수집
     8) 그 외 선택항목: 개인맞춤 서비스를 제공하기 위한 자료
     2. 단, 이용자의 기본적 인권 침해의 우려가 있는 민감한 개인정보(인종 및 민족, 사상 및 신조, 출신지 및 본적지, 정치적 성향 및 범죄기록, 건강상태 및 성생활 등)는 수집하지 않습니다.
     
     제5조 (쿠키에 의한 개인정보 수집)
     
     1. 쿠키(cookie)란?
     친절한 영어교실은 귀하에 대한 정보를 저장하고 수시로 찾아내는 ‘쿠키(cookie)’를 사용합니다. 쿠키는 웹사이트가 귀하의 컴퓨터 브라우저(넷스케이프, 인터넷 익스플로러 등)로 전송하는 소량의 정보입니다. 쿠키는 귀하의 컴퓨터는 식별하지만 귀하를 개인적으로 식별하지는 않습니다. 또한 귀하는 쿠키에 대한 선택권이 있습니다. 웹브라우저 상단의 도구 > 인터넷옵션 탭(option tab)에서 모든 쿠키를 다 받아들이거나, 쿠키가 설치될 때 통지를 보내도록 하거나, 아니면 모든 쿠키를 거부할 수 있는 선택권을 가질 수 있습니다.
     2. 친절한 영어교실의 쿠키(cookie) 운용
     1) 개인의 관심 분야에 따라 차별화된 정보를 제공
     2) 회원과 비회원의 접속빈도 또는 머문 시간 등을 분석하여 이용자의 취향과 관심분야를 파악하여 타겟(target) 마케팅에 활용
     3) 쇼핑한 품목들에 대한 정보와 관심 있게 둘러본 품목들에 대한 자취를 추적하여 다음 번 쇼핑 때 개인 맞춤 서비스를 제공
     4) 유료서비스 이용 시 이용기간 안내
     5) 회원들의 습관을 분석하여 서비스 개편 등의 척도
     6) 게시판 글 등록쿠키는 브라우저의 종료시나 로그 아웃 시 만료됩니다
     
     제6조 (목적 외 사용 및 제3자에 대한 제공 및 공유)
     
     1. 친절한 영어교실은 귀하의 개인정보를 「개인정보의 수집목적 및 이용목적」에서 고지한 범위 내에서 사용하며, 동 범위를 초과하여 이용하거나 타인 또는 타기업, 기관에 제공하지 않습니다.
     특히 다음의 경우는 주의를 기울여 개인정보를 이용 및 제공할 것입니다.
     1) 제휴 관계: 보다 나은 서비스 제공을 위하여 귀하의 개인정보를 제휴사에게 제공 하거나 또는 제휴사와 공유할 수 있습니다.
     개인정보를 제공하거나 공유 할 경우에는 사전에 귀하께 제휴사가 누구인지, 제공 또는 공유되는 개인 정보항목이 무엇인지, 왜 그러한 개인정보가
     제공되거나 공유되어야 하는지,그리고 언제까지 어떻게 보호 관리되는지에 대해 개별적으로 전자우편 및 서면을 통해 고지하여 동의를 구하는
     절차를 거치게 되며, 귀하께서 동의하지 않는 경우에 는 제휴사에게 제공하거나 제휴사와 공유하지 않습니다.
     제휴관계에 변화가 있거나 제휴관계가 종결될 때도 같은 절차에 의하여 고지하거나 동의를 구합니다.
     2) 위탁처리: 원활한 업무 처리를 위해 이용자의 개인정보를 위탁 처리할 경우 반드시 사전에 위탁처리 업체명과 위탁 처리되는 개인정보의 범위,
     업무위탁 목적, 위탁처리 되는 과정, 위탁관계 유지 기간 등에 대해 상세하게 고지합니다.
     3) 매각, 인수합병 등: 서비스제공자의 권리와 의무가 완전 승계 이전되는 경우 반드시 사전에 정당한 사유와 절차에 대해 상세하게 고지할 것이며
     이용자의 개인정보에 대한 동의 철회의 선택권을 부여합니다.
     2. 고지 및 동의방법은 온라인 홈페이지 초기화면의 공지사항을 통해 최소 10일 이전부터 고지함과 동시에 이메일 등을 이용하여 1회 이상 개별적으로 고지합니다.
     3. 다음은 예외로 합니다.
     1) 관계법령에 의하여 수사상의 목적으로 관계기관으로부터의 요구가 있을 경우
     2) 통계작성, 학술연구나 시장조사를 위하여 특정 개인을 식별할 수 없는 형태로 광고주 협력사나 연구단체 등에 제공하는 경우
     3) 기타 관계법령에서 정한 절차에 따른 요청이 있는 경우
     4) 그러나 예외 사항에서도 관계법령에 의하거나 수사기관의 요청에 의해 정보를 제공한 경우에는 이를 당사자에게 고지하는 것을 원칙으로 운영
     하고 있습니다.법률상의 근거에 의해 부득이하게 고지를 하지 못할 수도 있습니다. 본래의 수집목적 및 이용목적에 반하여 무분별하게 정보가
     제공되지 않도록 최대한 노력하겠습니다.
     
     제7조 (개인정보의 열람, 정정)
     
     1. 귀하는 언제든지 등록되어 있는 귀하의 개인정보를 열람하거나 정정하실 수 있습니다. 개인정보 열람 및 정정을 하고자 할 경우에는 마이페이지 > 『개인정보관리』를 클릭하여 직접 열람 또는 정정하거나, 개인정보관리책임자 및 담당자에게 서면, 전화 또는 E-mail로 연락하시면 지체 없이 조치하겠습니다.
     2. 귀하가 개인정보의 오류에 대한 정정을 요청한 경우, 정정을 완료하기 전까지 당해 개인 정보를 이용 또는 제공하지 않습니다.
     3. 잘못된 개인정보를 제3자에게 이미 제공한 경우에는 정정 처리결과를 제3자에게 지체 없이 통지하여 정정하도록 조치하겠습니다.
     
     제8조 (개인정보 수집, 이용, 제공에 대한 동의철회[회원탈퇴])
     
     1. 회원가입 등을 통해 개인정보의 수집, 이용, 제공에 대해 귀하께서 동의하신 내용을 귀하는 언제든지 철회하실 수 있습니다. 동의철회는 고객센터 > 『회원탈퇴』를 클릭하거나 개인정보관리책임자에게 팩스, 우편, 고객센터, 전화 등으로 연락하시면 회원탈퇴 신청 시점으로부터 90일 동안 재가입 방지를 위한 개인정보보존 이후 개인정보의 삭제 등 필요한 조치를 하겠습니다. 동의 철회를 하고 개인정보를 파기하는 등의 조치를 취한 경우에는 그 사실을 귀하께 지체 없이 통지하도록 하겠습니다.
     2. 친절한 영어교실은 개인정보의 수집에 대한 동의철회(회원탈퇴)를 개인정보를 수집하는 방법보다 쉽게 할 수 있도록 필요한 조치를 취하겠습니다.
     
     제9조 개인정보의 보유기간 및 이용기간
     
     1. 회원님의 개인정보는 다음과 같이 개인정보의 수집목적 또는 제공받은 목적이 달성되면 개인정보를 지체 없이 파기합니다.
     1) 종이에 출력된 개인 정보 : 분쇄기로 분쇄하거나 소각
     2) 전자적 파일 형태로 저장된 개인 정보 : 기록을 재사용할 수 없는 기술적 방법을 사용하여 삭제
     단, 상법, 전자상거래 등에서의 소비자보호에 관한 법률 등 관련법령의 규정에 의하여 다음과 같이 거래 관련 권리 의무 관계의 확인 등을 이유로
     일정기간 보유하여야 할 필요가 있을 경우에는 일정기간 보유합니다
     - 계약 또는 청약철회 등에 관한 기록: 5년
     - 대금결제 및 재화 등의 공급에 관한 기록: 5년
     - 소비자의 불만 또는 분쟁처리에 관한 기록: 3년
     - 회원가입정보의 경우, 회원가입을 탈퇴하거나 회원에서 제명된 경우 등 일정한 사전에 보유목적, 기간 및 보유하는 개인정보 항목을 명시하여
     동의를 구합니다.
     - 재가입 방지를 위한 가입정보 기록: 90일
     - 자료 등록 및 판매에 관한 기록: 180일
     2. 귀하의 동의를 받아 보유하고 있는 거래정보 등을 귀하께서 열람을 요구하는 경우 친절한 영어교실은 지체 없이 그 열람 확인 할 수 있도록 조치합니다.
     
     제10조 (개인정보보호를 위한 기술 및 관리적 대책)
     
     1. 기술적 대책
     친절한 영어교실은 귀하의 개인정보를 취급함에 있어 개인정보가 분실, 도난, 누출, 변조 또는 훼손되지 않도록 안전성 확보를 위하여 다음과 같은 기술적 대책을 강구하고 있습니다.
     1) 귀하의 개인정보는 비밀번호에 의해 보호되며 파일 및 전송데이터를 암호화하거나 파일 잠금기능(Lock)을 사용하여 중요한 데이터는 별도의
     보안기능을 통해 보호되고 있습니다.
     2) 친절한 영어교실은 백신프로그램을 이용하여 컴퓨터바이러스에 의한 피해를 방지하기 위한 조치를 취하고 있습니다. 백신프로그램은 주기적으로
     업데이트되며 갑작스런 바이러스가 출현할 경우 백신이 나오는 즉시 이를 제공함으로써 개인정보가 침해되는 것을 방지하고 있습니다.
     3) 친절한 영어교실은 암호알고리즘을 이용하여 네트워크 상의 개인정보를 안전하게 전송할 수 있는 보안장치(SSL)를 채택하고 있습니다.
     4) 해킹 등 외부침입에 대비하여 각 서버마다 침입차단시스템 및 취약점 분석시스템 등을 이용하여 보안에 만전을 기하고 있습니다.
     2. 관리적 대책
     1) 친절한 영어교실은 귀하의 개인정보에 대한 접근권한을 최소한의 인원으로 제한하고 있습니다.
     그 최소한의 인원에 해당하는 자는 다음과 같습니다.
     - 이용자를 직접 상대로 하여 마케팅 업무를 수행하는 자
     - 고객의 불만 및 이용문의 처리 업무를 수행하는 자
     - 개인정보관리책임자 및 담당자 등 개인정보관리업무를 수행하는 자
     - 기타 업무상 개인정보의 취급이 불가피한 자
     2) 입사 시 전 직원의 보안서약서를 통하여 사람에 의한 정보유출을 사전에 방지하고 개인정보처리방침에 대한 이행사항 및 직원의 준수여부를
     감사하기 위한 내부절차를 마련하고 있습니다.
     3) 개인정보 관련 취급자의 업무 인수인계는 보안이 유지된 상태에서 철저하게 이뤄지고 있으며 입사 및 퇴사 후 개인정보 사고에 대한 책임을
     명확화하고 있습니다.
     4) 친절한 영어교실은 이용자 개인의 실수나 기본적인 인터넷의 위험성 때문에 일어나는 일들에 대해 책임을 지지 않습니다. 회원 개개인이 본인의
     개인정보를 보호하기 위해서 자신의 ID 와 비밀번호를 적절하게 관리하고 여기에 대한 책임을 져야 합니다.
     5) 그 외 내부 관리자의 실수나 기술관리 상의 사고로 인해 개인정보의 상실, 유출, 변조, 훼손이 유발될 경우 친절한 영어교실은 즉각 귀하께 사실을
     알리고 적절한 대책과 보상을 강구할 것입니다.
     
     제11조 (링크사이트)
     
     친절한 영어교실은 귀하께 다른 회사의 웹사이트 또는 자료에 대한 링크를 제공할 수 있습니다. 이 경우 친절한 영어교실은 외부사이트 및 자료에 대한 아무런 통제권이 없으므로 그로부터 제공받는 서비스나 자료의 유용성에 대해 책임질 수 없으며 보증할 수 없습니다. 친절한 영어교실이 포함하고 있는 링크를 클릭(click)하여 타 사이트(site)의 페이지로 옮겨갈 경우 해당 사이트의 개인정보처리방침은 친절한 영어교실과 무관하므로 새로 방문한 사이트의 정책을 검토해 보시기 바랍니다.
     
     제12조 (게시물)
     
     1. 친절한 영어교실은 귀하의 게시물을 소중하게 생각하며 변조, 훼손, 삭제되지 않도록 최선을 다하여 보호합니다. 그러나 다음의 경우는 그러지 아니합니다.
     1) 스팸(spam)성 게시물 (예 : 행운의 편지, 8억 메일, 특정사이트 광고 등)
     2) 타인을 비방할 목적으로 허위 사실을 유포하여 타인의 명예를 훼손하는 글
     3) 동의 없는 타인의 신상공개, 친절한 영어교실의 저작권, 제 3자의 저작권 등 권리를 침해하는 내용, 기타 게시판 주제와 다른 내용의 게시물
     4) 친절한 영어교실은 바람직한 게시판 문화를 활성화하기 위하여 동의 없는 타인의 신상 공개시 특정 부분을 삭제하거나 기호 등으로 수정하여 게시할
     수 있습니다.
     5) 다른 주제의 게시판으로 이동 가능한 내용일 경우 해당 게시물에 이동 경로를 밝혀 오해가 없도록 하고 있습니다.
     6) 그 외의 경우 명시적 또는 개별적인 경고 후 삭제 조치할 수 있습니다.
     2. 근본적으로 게시물에 관련된 제반 권리와 책임은 작성자 개인에게 있습니다. 또한 게시물을 통해 자발적으로 공개된 정보는 회사의 필요에 따라 홈페이지 게시, 외부 사이트 게시 등으로 활용할 수 있으며, 보호받기 어려우므로 정보 공개 전에 심사숙고 하시기 바랍니다. 
     
     제14조 (이용자의 권리와 의무)
     
     1. 귀하의 개인정보를 최신의 상태로 정확하게 입력하여 불의의 사고를 예방해 주시기 바랍니다. 이용자가 입력한 부정확한 정보로 인해 발생하는 사고의 책임은 이용자 자신에게 있으며 타인 정보의 도용 등 허위정보를 입력할 경우 회원자격이 상실될 수 있습니다.
     2. 귀하는 개인정보를 보호받을 권리와 함께 스스로를 보호하고 타인의 정보를 침해하지 않을 의무도 가지고 있습니다. 비밀번호를 포함한 귀하의 개인정보가 유출되지 않도록 조심하시고 게시물을 포함한 타인의 개인정보를 훼손하지 않도록 유의해 주십시오. 만약 이 같은 책임을 다하지 못하고 타인의 정보 및 존엄성을 훼손할 시에는 『정보통신망이용촉진 및 정보보호 등에 관한 법률』등에 의해 처벌받을 수 있습니다.
     3. 만 14세 미만의 아동의 경우, 법정대리인이 아동의 개인정보를 조회하거나 수정할 권리, 수집 및 이용 동의를 철회할 권리를 가집니다.
     
     제15조 (의견수렴 및 불만처리)
     
     1. 당사는 귀하의 의견을 소중하게 생각하며, 귀하는 의문사항으로부터 언제나 성실한 답변을 받을 권리가 있습니다.
     2. 당사는 귀하와의 원활환 의사소통을 위해 고객센터를 운영하고 있으며 연락처는 다음과 같습니다.
     [개인정보침해신고센터]
     전화 : 1336
     URL : http://www.cyberprivacy.or.kr
     제16조 (개인정보관리책임자 및 담당자)
     친절한 영어교실은 귀하가 좋은 정보를 안전하게 이용할 수 있도록 최선을 다하고 있습니다. 개인정보를 보호하는데 있어 귀하께 고지한 사항들에 반하는 사고가 발생할 시에 개인정보관리책임자가 모든 책임을 집니다. 그러나 기술적인 보 완조치를 했음에도 불구하고, 해킹 등 기본적인 네트워크상의 위험성에 의해 발생하는 예기치 못한 사고로 인한 정보의 훼손 및 방문자가 작성한 게시물에 의한 각종 분쟁에 관해서는 책임이 없습니다. 귀하의 개인정보를 취급하는 책임자 및 담당자는 다음과 같으며 개인정보 관련 문의사항에 신속하고 성실하게 답변해드리고 있습니다.
     
     제17조 (아동의 개인정보보호)
     
     만 14세 미만 아동의 계정등록은 별도의 양식을 통해 이루어지고 있으며 개인정보 수집 시 법정대리인의 동의를 구하고 있습니다. 이 경우 법정 대리인은 다음 각 사항을 입력하여야 합니다. - 법정대리인의 성명, 휴대폰번호, 생년월일, 성별
     1. 이용자 및 법정대리인의 권리와 그 행사방법
     1) 정보주체는 회사에 대해 언제든지 다음 각 호의 개인정보 보호 관련 권리를 행사할 수 있습니다. 
     ① 개인정보 열람 요구
     ② 오류 등이 있을 경우 정정 요구
     ③ 삭제 요구
     ④ 처리정지 요구
     2) 제1항에 따른 권리 행사는 회사에 대해 서면, 전화, 전자우편, 모사전송(FAX) 등을 통하여 하실 수 있으며 회사는 이에 대해 지체 없이 조치하겠습니다.
     3) 정보주체가 개인정보의 오류 등에 대한 정정 또는 삭제를 요구한 경우에는 회사는 정정 또는 삭제를 완료할 때까지 당해 개인정보를 이용하거나 제공하지 않습니다.
     4) 제1항에 따른 권리 행사는 정보주체의 법정대리인이나 위임을 받은 자 등 대리인을 통하여 하실 수 있습니다. 이 경우 개인정보 보호법 시행규칙 별지 제11호 서식에 따른 위임장을 제출하셔야 합니다.
     5) 정보주체는 개인정보보호법 등 관계법령을 위반하여 회사가 처리하고 있는 정보주체 본인이나 타인의 개인정보 및 사생활을 침해하여서는 아니 됩니다.
     
     제18조 (광고성 정보 전송)
     
     1. 친절한 영어교실은 귀하의 명시적인 수신거부의사에 반하여 영리목적의 광고성 정보를 전송하지 않습니다.
     2. 친절한 영어교실은 귀하가 뉴스레터 등 전자우편 전송에 대한 동의를 한 경우 전자우편의 제목란 및 본문란에 다음 사항과 같이 귀하가 쉽게 알아 볼 수 있도록 조치합니다.
     1) 전자우편의 제목 : (광고)라는 문구를 제목란에 표시하지 않을 수 있으며 전자우편 본문란의 주요 내용을 표시합니다.
     2) 전자우편의 본문 : 귀하가 수신거부의 의사표시를 할 수 있는 전송자의 명칭, 전자우편주소, 전화번호 및 주소를 명시합니다.
     귀하가 수신 거부의 의사를 쉽게 표시할 수 있는 방법을 한글 및 영문으로 각각 명시합니다. 귀하가 동의를 한 시기 및 내용을 명시합니다.
     3. 친절한 영어교실은 상품정보 안내 등 온라인 마케팅을 위해 광고성 정보를 전자우편 등으로 전송하는 경우 전자우편의 제목란 및 본문란에 다음 사항과 같이 귀하가 쉽게 알아 볼 수 있도록 조치합니다.
     1) 전자우편의 제목 : (광고)또는(성인광고)라는 문구를 제목란의 처음에 빈칸 없이 한글로 표시하고 이어서 전자우편 본문란의 주요 내용을 표시합니다.
     2) 전자우편의 본문 : 귀하가 수신거부의 의사표시를 할 수 있는 전송자의 명칭, 전자우편주소, 전화번호 및 주소를 명시합니다.
     귀하가 수신 거부의 의사를 쉽게 표시할 수 있는 방법을 한글 및 영문으로 각 각 명시합니다.
     4. 다음과 같이 청소년에게 유해한 정보를 전송하는 경우 “(성인광고)” 문구를 표시합니다.
     1) 본문란에 다음 각 항목 1에 해당하는 것이 부호/문자/영상 또는 음향의 형태로 표현된 경우(해당 전자우편의 본문란에는 직접 표현되어있지
     아니하더라도 수신자가 내용을 쉽게 확인할 수 있도록 기술적 조치가 되어 있는 경우를 포함한다)에는 해당 전자우편의 제목란에 "(성인광고)"
     문구를 표시합니다.
     청소년(19세미만의 자를 말한다. 이하 같다)에게 성적인 욕구를 자극하는 선정적인 것이거나 음란한 것
     청소년에게 포악성이나 범죄의 충동을 일으킬 수 있는 것
     성폭력을 포함한 각종 형태의 폭력행사와 약물의 남용을 자극하거나 미화하는 것
     청소년보호법에 의하여 청소년 유해 매체물로 결정 고시된 것
     2) 홈페이지를 알리는 경우에는 해당 전자우편의 제목란에 “(성인광고)” 문구를 표시합니다.
     5. 팩스/휴대폰 문자전송 등 전자우편 이외의 문자전송을 통해 영리목적의 광고성 정보를 전송하는 경우에는 전송내용 처음에 “(광고)”라는 문구를 표기하고 전송내용 중에 전송자의 연락처를 명시하도록 조치합니다
               `}
                    </PreText>
                  </TermsText>

                  <Wrapper al={`flex-start`} margin={`14px 0 0`}>
                    <CustomCheckbox
                      checked={checkBox02}
                      onChange={checkBox02Toggle}
                    >
                      <Text fontSize={`22px`}>
                        (필수) 개인정보 수집 및 이용안내에 동의합니다.
                      </Text>
                    </CustomCheckbox>
                  </Wrapper>

                  <Wrapper margin={`60px 0 0`}>
                    <CommonButton
                      onClick={() => selectTabHandler(2)}
                      width={width < 700 ? `100%` : `290px`}
                      kindOf={`basic`}
                      fontSize={`20px`}
                      fontWeight={`600`}
                      height={`54px`}
                    >
                      회원가입
                    </CommonButton>
                  </Wrapper>
                </Wrapper>
              )}

              {selectTab === 2 && (
                <Wrapper
                  width={width < 700 ? `100%` : `420px`}
                  margin={`60px 0 0`}
                >
                  <CustomForm form={cForm} onFinish={signupHandler}>
                    <Text fontSize={`20px`} margin={`0 0 12px`}>
                      <SpanText color={Theme.basicTheme_C}>*</SpanText>
                      아이디
                    </Text>

                    <Wrapper dr={`row`} ju={`space-between`} margin={`0 0 7px`}>
                      <Wrapper width={`calc(100% - 146px)`}>
                        <Form.Item
                          name="userId"
                          rules={[
                            {
                              required: true,
                              message: "아이디는 필수 입니다.",
                            },
                          ]}
                        >
                          <TextInput
                            width={`100%`}
                            height={`54px`}
                            radius={`5px`}
                            border={`1px solid ${Theme.lightGrey4_C}`}
                            fontSize={`18px`}
                            placeholder="아이디를 입력해주세요."
                          />
                        </Form.Item>
                      </Wrapper>
                      <CommonButton
                        onClick={userIdFindHandler}
                        fontSize={`18px`}
                        width={`140px`}
                        height={`54px`}
                        margin={`0 0 23px`}
                        loading={st_userCheckUserIdLoading}
                      >
                        중복확인
                      </CommonButton>
                    </Wrapper>

                    <Text fontSize={`20px`} margin={`0 0 12px`}>
                      <SpanText color={Theme.basicTheme_C}>*</SpanText>
                      비밀번호
                    </Text>

                    <Wrapper dr={`row`} ju={`space-between`} margin={`0 0 7px`}>
                      <Form.Item
                        name="password"
                        rules={[
                          {
                            required: true,
                            message: "비밀번호는 필수 입니다.",
                          },
                        ]}
                        style={{ margin: `0 0 10px` }}
                      >
                        <TextInput
                          type="password"
                          width={`100%`}
                          height={`54px`}
                          radius={`5px`}
                          border={`1px solid ${Theme.lightGrey4_C}`}
                          fontSize={`18px`}
                          placeholder="비밀번호를 입력해주세요."
                        />
                      </Form.Item>

                      <Form.Item
                        name="rePassword"
                        rules={[
                          {
                            required: true,
                            message: "비밀번호를 재입력해주세요.",
                          },
                        ]}
                      >
                        <TextInput
                          type="password"
                          width={`100%`}
                          height={`54px`}
                          radius={`5px`}
                          border={`1px solid ${Theme.lightGrey4_C}`}
                          fontSize={`18px`}
                          placeholder="비밀번호를 재입력해주세요."
                        />
                      </Form.Item>
                    </Wrapper>

                    <Text fontSize={`20px`} margin={`0 0 12px`}>
                      <SpanText color={Theme.basicTheme_C}>*</SpanText>
                      이름
                    </Text>

                    <Wrapper dr={`row`} ju={`space-between`} margin={`0 0 7px`}>
                      <Form.Item
                        name="username"
                        rules={[
                          {
                            required: true,
                            message: "성함은 필수 입니다.",
                          },
                        ]}
                      >
                        <TextInput
                          width={`100%`}
                          height={`54px`}
                          radius={`5px`}
                          border={`1px solid ${Theme.lightGrey4_C}`}
                          fontSize={`18px`}
                          placeholder="성함을 입력해주세요."
                        />
                      </Form.Item>
                    </Wrapper>

                    <Text fontSize={`20px`} margin={`0 0 12px`}>
                      <SpanText color={Theme.basicTheme_C}>*</SpanText>
                      이메일
                    </Text>

                    <Wrapper dr={`row`} ju={`space-between`} margin={`0 0 7px`}>
                      <Form.Item
                        name="email"
                        rules={[
                          {
                            required: true,
                            message: "이메일은 필수 입니다.",
                          },
                        ]}
                      >
                        <TextInput
                          type="email"
                          width={`100%`}
                          height={`54px`}
                          radius={`5px`}
                          border={`1px solid ${Theme.lightGrey4_C}`}
                          fontSize={`18px`}
                          placeholder="이메일을 입력해주세요."
                        />
                      </Form.Item>
                    </Wrapper>

                    <Text fontSize={`20px`} margin={`0 0 12px`}>
                      <SpanText color={Theme.basicTheme_C}>*</SpanText>
                      연락처
                    </Text>

                    <Wrapper dr={`row`} ju={`space-between`} margin={`0 0 7px`}>
                      <Form.Item
                        name="mobile"
                        rules={[
                          {
                            required: true,
                            message: "연락처는 필수 입니다.",
                          },
                        ]}
                      >
                        <TextInput
                          type="number"
                          width={`100%`}
                          height={`54px`}
                          radius={`5px`}
                          border={`1px solid ${Theme.lightGrey4_C}`}
                          fontSize={`18px`}
                          placeholder="연락처를 입력해주세요."
                        />
                      </Form.Item>
                    </Wrapper>

                    <Text fontSize={`20px`} margin={`0 0 12px`}>
                      성별
                    </Text>

                    <Wrapper
                      dr={`row`}
                      ju={`space-between`}
                      margin={`0 0 30px`}
                    >
                      <CommonButton
                        width={`calc(50% - 5px)`}
                        height={`54px`}
                        radius={`100px`}
                        fontSize={`20px`}
                        onClick={() => selectGenderHandler("여성")}
                        kindOf={
                          selectGender && selectGender === "여성" && `basic`
                        }
                      >
                        여성
                      </CommonButton>
                      <CommonButton
                        width={`calc(50% - 5px)`}
                        height={`54px`}
                        radius={`100px`}
                        fontSize={`20px`}
                        onClick={() => selectGenderHandler("남성")}
                        kindOf={
                          selectGender && selectGender === "남성" && `basic`
                        }
                      >
                        남성
                      </CommonButton>
                    </Wrapper>

                    <Text fontSize={`20px`} margin={`0 0 12px`}>
                      출생년도
                    </Text>

                    <Wrapper dr={`row`} ju={`space-between`} margin={`0 0 7px`}>
                      <Form.Item name="birth">
                        <DatePicker
                          style={{
                            width: `100%`,
                            height: `54px`,
                            fontSize: `18px`,
                          }}
                          format={"YYYY"}
                          picker="year"
                          placeholder="출생년도를 선택해주세요."
                        />
                      </Form.Item>
                    </Wrapper>

                    <Text fontSize={`20px`} margin={`0 0 12px`}>
                      주소
                    </Text>

                    <Wrapper>
                      <Wrapper
                        dr={`row`}
                        ju={`space-between`}
                        margin={`0 0 7px`}
                      >
                        <Wrapper width={`calc(100% - 146px)`}>
                          <Form.Item
                            name="zoneCode"
                            style={{ margin: `0 0 10px` }}
                          >
                            <TextInput
                              width={`100%`}
                              height={`54px`}
                              radius={`5px`}
                              border={`1px solid ${Theme.lightGrey4_C}`}
                              fontSize={`18px`}
                              placeholder="주소를 검색해주세요."
                              readOnly
                            />
                          </Form.Item>
                        </Wrapper>
                        <CommonButton
                          width={`140px`}
                          height={`54px`}
                          margin={`0 0 10px`}
                          onClick={aModalToggle}
                        >
                          우편번호 검색
                        </CommonButton>

                        <Form.Item
                          name="address"
                          style={{ margin: `0 0 10px` }}
                        >
                          <TextInput
                            width={`100%`}
                            height={`54px`}
                            radius={`5px`}
                            border={`1px solid ${Theme.lightGrey4_C}`}
                            fontSize={`18px`}
                            placeholder="주소를 검색해주세요."
                            readOnly
                          />
                        </Form.Item>

                        <Form.Item name="detailAddress">
                          <TextInput
                            width={`100%`}
                            height={`54px`}
                            radius={`5px`}
                            border={`1px solid ${Theme.lightGrey4_C}`}
                            fontSize={`18px`}
                            placeholder="상세주소를 입력해주세요."
                          />
                        </Form.Item>
                      </Wrapper>
                    </Wrapper>

                    <Wrapper>
                      <CommonButton
                        width={`100%`}
                        height={`54px`}
                        fontSize={`20px`}
                        fontWeight={`600`}
                        kindOf={`basic`}
                        htmlType="submit"
                        loading={st_signUpLoading}
                      >
                        회원가입
                      </CommonButton>
                    </Wrapper>
                  </CustomForm>
                </Wrapper>
              )}

              {selectTab === 3 && (
                <Wrapper margin={`60px 0 0`}>
                  <Image
                    width={`60px`}
                    src={
                      "https://4leaf-s3.s3.ap-northeast-2.amazonaws.com/newEbook/original/%E1%84%92%E1%85%AC%E1%84%8B%E1%85%AF%E1%86%AB%E1%84%80%E1%85%A1%E1%84%8B%E1%85%B5%E1%86%B8+%E1%84%8B%E1%85%AA%E1%86%AB%E1%84%85%E1%85%AD+%E1%84%8B%E1%85%A1%E1%84%8B%E1%85%B5%E1%84%8F%E1%85%A9%E1%86%AB.png"
                    }
                    alt="successIcon"
                  />

                  <Text margin={`20px 0 50px`} fontSize={`20px`}>
                    회원가입이 완료되었습니다!
                  </Text>

                  <CommonButton
                    width={width < 700 ? `100%` : `290px`}
                    height={`54px`}
                    fontSize={`20px`}
                    fontWeight={`600`}
                    kindOf={`basic`}
                    onClick={() => moveLinkHandler("/")}
                  >
                    메인으로
                  </CommonButton>
                </Wrapper>
              )}

              {/* ADDRESS MODAL */}
              <Modal
                title="주소 검색"
                visible={aModal}
                onCancel={aModalToggle}
                footer={null}
              >
                <DaumPostcode
                  onComplete={(data) => {
                    cForm.setFieldsValue({
                      zoneCode: data.zonecode,
                      address: data.address,
                    });
                    setAModal(false);
                  }}
                  width={`100%`}
                  height={`450px`}
                  autoClose
                  animation
                />
              </Modal>
            </Wrapper>
          </RsWrapper>
        </WholeWrapper>
      </ClientLayout>
    </>
  );
};

export const getServerSideProps = wrapper.getServerSideProps(
  async (context) => {
    // SSR Cookie Settings For Data Load/////////////////////////////////////
    const cookie = context.req ? context.req.headers.cookie : "";
    axios.defaults.headers.Cookie = "";
    if (context.req && cookie) {
      axios.defaults.headers.Cookie = cookie;
    }
    ////////////////////////////////////////////////////////////////////////
    // 구현부

    context.store.dispatch({
      type: LOAD_MY_INFO_REQUEST,
    });

    // 구현부 종료
    context.store.dispatch(END);
    console.log("🍀 SERVER SIDE PROPS END");
    await context.store.sagaTask.toPromise();
  }
);

export default SignUp;
